<script>

var emdList = {
    north: ['건입동','내도동','노형동','도남동','도두동','도련1동','도련2동','도평동','봉개동','삼도1동','삼도2동','삼양동','아라동','애월읍','연동','영평동','오등동','오라동','외도동','용강동','용담1동','용담2동','용담3동','이도1동','이도2동','이호동','일도1동','일도2동','조천읍','해안동','화북동','회천동'],
    south: ['강정동','남원읍','대륜동','대천동','대포동','도순동','동홍동','법환동','보목동','상예동','상효동','색달동','서귀동','서호동','서홍동','송산동','신효동','안덕면','영남동','영천동','예래동','월평동','정방동','중문동','중앙동','천지동','토평동','하예동','하원동','하효동','호근동','회수동','효돈동'],
    east: ['구좌읍','성산읍','표선면','우도면'],
    west: ['대정읍','한경면','한림읍'],
    chinese: ['이호동','연동','아라동','예래동'],
    korean: ['용담2동','중문동','성산읍','안덕면','우도면'],
    businese: ['삼도1동','이도2동','일도2동','외도동','화북동','동홍동'],
    jejusi: ['일도1동', '용담1동', '이도1동', '삼도2동', '건입동'],
    sgpsi: ['송산동','천지동','정방동','중앙동']
};
var emdCoordList = {
    north: [
        {
            name: '건입동',
            centerCoord:{x: 126.53167404509885, y: 33.51484516712193}
        },
        {
            name: '내도동',
            centerCoord:{x: 126.44282061607593, y: 33.492687827184106}
        },
        {
            name: '노형동',
            centerCoord:{x: 126.47719162510411, y: 33.48307878154323}
        },
        {
            name: '도남동',
            centerCoord:{x: 126.52447587950302, y: 33.48486324546967}
        },
        {
            name: '도두동',
            centerCoord:{x: 126.46803100554828, y: 33.503152471569734}
        },
        {
            name: '도련1동',
            centerCoord:{x: 126.58929307261687, y: 33.505608109044985}
        },
        {
            name: '도련2동',
            centerCoord:{x: 126.59619709785446, y: 33.5160243791913}
        },
        {
            name: '도평동',
            centerCoord:{x: 126.45117620752792, y: 33.478865871563194}
        },
        {
            name: '봉개동',
            centerCoord:{x: 126.59493725385263, y: 33.49164474409383}
        },
        {
            name: '삼도1동',
            centerCoord:{x: 126.51822566067219, y: 33.5037004248757}
        },
        {
            name: '삼도2동',
            centerCoord:{x: 126.52221077931873, y: 33.51173640995392}
        },
        {
            name: '삼양동',
            centerCoord:{x: 126.58556957055995, y: 33.521813567115444}
        },
        {
            name: '아라동',
            centerCoord:{x: 126.54497680558913, y: 33.47631374079073}
        },
        {
            name: '애월읍',
            centerCoord:{x: 126.32944339564453, y: 33.46199885718664}
        },
        {
            name: '연동',
            centerCoord:{x: 126.49688187292138, y: 33.48819116699351}
        },
        {
            name: '영평동',
            centerCoord:{x: 126.57785417416218, y: 33.42588627643379}
        },
        {
            name: '오등동',
            centerCoord:{x: 126.54068535706757, y: 33.44303612780883}
        },
        {
            name: '오라동',
            centerCoord:{x: 126.51155774313591, y: 33.49523542003126}
        },
        {
            name: '외도동',
            centerCoord:{x: 126.43217519087432, y: 33.4928558848117}
        },
        {
            name: '용강동',
            centerCoord:{x: 126.60191270451602, y: 33.43176134580304}
        },
        {
            name: '용담1동',
            centerCoord:{x: 126.51330519458884, y: 33.50910155709181}
        },
        {
            name: '용담2동',
            centerCoord:{x: 126.51168595575041, y: 33.511497021115886}
        },
        {
            name: '용담3동',
            centerCoord:{x: 126.49284106312992, y: 33.517602596292164}
        },
        {
            name: '이도1동',
            centerCoord:{x: 126.52697686312928, y: 33.50694381069121}
        },
        {
            name: '이도2동',
            centerCoord:{x: 126.53529062003187, y: 33.4971082463972}
        },
        {
            name: '이호동',
            centerCoord:{x: 126.45809934046648, y: 33.499798798456126}
        },
        {
            name: '일도1동',
            centerCoord:{x: 126.5263864721644, y: 33.51495849959597}
        },
        {
            name: '일도2동',
            centerCoord:{x: 126.53828685755926, y: 33.51163868877873}
        },
        {
            name: '조천읍',
            centerCoord:{x: 126.63413639185518, y: 33.53443737686116}
        },
        {
            name: '해안동',
            centerCoord:{x: 126.47144551729706, y: 33.41438159076884}
        },
        {
            name: '화북동',
            centerCoord:{x: 126.56546557334424, y: 33.520233604476715}
        },
        {
            name: '회천동',
            centerCoord:{x: 126.61290300032954, y: 33.49261458369832}
        }
    ],
    south: [
        {
            name: '강정동',
            centerCoord:{x: 126.49578744997268, y: 33.26492681780662}
        },
        {
            name: '남원읍',
            centerCoord:{x: 126.72066130499283, y: 33.27990641867461}
        },
        {
            name: '대륜동',
            centerCoord:{x: 126.51135300492516, y: 33.248135759140865}
        },
        {
            name: '대천동',
            centerCoord:{x: 126.47761769768294, y: 33.250782858455864}
        },
        {
            name: '대포동',
            centerCoord:{x: 126.45445172215548, y: 33.30260230977175}
        },
        {
            name: '도순동',
            centerCoord:{x: 126.47880943353277, y: 33.29295494601814}
        },
        {
            name: '동홍동',
            centerCoord:{x: 126.56892411333416, y: 33.25783017224424}
        },
        {
            name: '법환동',
            centerCoord:{x: 126.51414478394295, y: 33.2431480689473}
        },
        {
            name: '보목동',
            centerCoord:{x: 126.60026876573498, y: 33.2457159675718}
        },
        {
            name: '상예동',
            centerCoord:{x: 126.38445624209322, y: 33.285198745684}
        },
        {
            name: '상효동',
            centerCoord:{x: 126.57055025821201, y: 33.32198460267826}
        },
        {
            name: '색달동',
            centerCoord:{x: 126.4083683771945, y: 33.27899633104421}
        },
        {
            name: '서귀동',
            centerCoord:{x: 126.56247154652564, y: 33.24934674343107}
        },
        {
            name: '서호동',
            centerCoord:{x: 126.51733825392256, y: 33.26418284673081}
        },
        {
            name: '서홍동',
            centerCoord:{x: 126.56017243438846, y: 33.255891678715344}
        },
        {
            name: '송산동',
            centerCoord:{x: 126.56599956276095, y: 33.245052916365196}
        },
        {
            name: '신효동',
            centerCoord:{x: 126.61074913107068, y: 33.26819983114735}
        },
        {
            name: '안덕면',
            centerCoord:{x: 126.33707454937671, y: 33.249658687171795}
        },
        {
            name: '영남동',
            centerCoord:{x: 126.5020791487844, y: 33.315158054272494}
        },
        {
            name: '영천동',
            centerCoord:{x: 126.58690191081551, y: 33.2687792711372}
        },
        {
            name: '예래동',
            centerCoord:{x: 126.39787248411164, y: 33.25428126229108}
        },
        {
            name: '월평동',
            centerCoord:{x: 126.46402793023239, y: 33.243793337702414}
        },
        {
            name: '정방동',
            centerCoord:{x: 126.56524872014667, y: 33.245865368520036}
        },
        {
            name: '중문동',
            centerCoord:{x: 126.43476738334367, y: 33.25145743823663}
        },
        {
            name: '중앙동',
            centerCoord:{x: 126.56510848961167, y: 33.25078056821079}
        },
        {
            name: '천지동',
            centerCoord:{x: 126.56124299653011, y: 33.24782046325472}
        },
        {
            name: '토평동',
            centerCoord:{x: 126.58516063917929, y: 33.28202018639086}
        },
        {
            name: '하예동',
            centerCoord:{x: 126.37871322705122, y: 33.24121090601957}
        },
        {
            name: '하원동',
            centerCoord:{x: 126.46602264334025, y: 33.27853966508706}
        },
        {
            name: '하효동',
            centerCoord:{x: 126.61833412744845, y: 33.25661033960738}
        },
        {
            name: '호근동',
            centerCoord:{x: 126.53275576953324, y: 33.261508005926565}
        },
        {
            name: '회수동',
            centerCoord:{x: 126.44362486821441, y: 33.26192013922733}
        },
        {
            name: '효돈동',
            centerCoord:{x: 126.61556181303158, y: 33.26330272298272}
        }
    ],
    east: [
        {
            name: '구좌읍',
            centerCoord:{x: 126.85197161764818, y: 33.52262758833819}
        },
        {
            name: '성산읍',
            centerCoord:{x: 126.91121070172285, y: 33.44228255293674}
        },
        {
            name: '표선면',
            centerCoord:{x: 126.83154965429163, y: 33.32648966571103}
        },
        {
            name: '우도면',
            centerCoord:{x: 126.95327803561862, y: 33.506489209100536}
        }
    ],
    west: [
        {
            name: '대정읍',
            centerCoord:{x: 126.25214988601175, y: 33.22684588067445}
        },
        {
            name: '한경면',
            centerCoord:{x: 126.18415707698696, y: 33.35013231995938}
        },
        {
            name: '한림읍',
            centerCoord:{x: 126.26709709014312, y: 33.41042512879528}
        }
    ],
    chinese: ['이호동', '연동', '아라동', '예래동'],
    korean: ['용담2동', '중문동', '성산읍', '안덕면', '우도면'],
    businese: ['삼도1동', '이도2동', '일도2동', '외도동', '화북동', '동홍동'],
    jejusi: ['일도1동', '용담1동', '이도1동', '삼도2동', '건입동'],
    sgpsi: ['송산동', '천지동', '정방동', '중앙동']
};

</script>