<script>

var emdList = {
    north: ['건입동','내도동','노형동','도남동','도두동','도련1동','도련2동','도평동','봉개동','삼도1동','삼도2동','삼양동','아라동','애월읍','연동','영평동','오등동','오라동','외도동','용강동','용담1동','용담2동','용담3동','이도1동','이도2동','이호동','일도1동','일도2동','조천읍','해안동','화북동','회천동'],
    south: ['강정동','남원읍','대륜동','대천동','대포동','도순동','동홍동','마라도','법환동','보목동','상예동','상효동','색달동','서귀동','서호동','서홍동','송산동','신효동','안덕면','영남동','영천동','예래동','월평동','이어도','정방동','중문동','중앙동','천지동','토평동','하예동','하원동','하효동','호근동','회수동','효돈동'],
    east: ['구좌읍','성산읍','표선면','우도면'],
    west: ['대정읍','한경면','한림읍'],
    chinese: ['이호동','연동','아라동','예래동'],
    korean: ['용담2동','중문동','성산읍','안덕면','우도면'],
    businese: ['삼도1동','이도2동','일도2동','외도동','화북동','동홍동'],
    jejusi: ['일도1동', '용담1동', '이도1동', '삼도2동', '건입동'],
    sgpsi: ['송산동','천지동','정방동','중앙동']
};
var emdCoordList = {
    north: [
        {
            name: '건입동',
            centerCoord:{x: 126.53167404509885, y: 33.51484516712193}
        },
        {
            name: '내도동',
            centerCoord:{x: 126.44282061607593, y: 33.492687827184106}
        }
    ],
    south: [
        {
            name: '강정동',
            centerCoord:{x: 126.49578744997268, y: 33.26492681780662}
        }
    ],
    east: [
        {
            name: '구좌읍',
            centerCoord:{x: 126.85197161764818, y: 33.52262758833819}
        }
    ],
    west: [
        {
            name: '대정읍',
            centerCoord:{x: 126.25214988601175, y: 33.22684588067445}
        }
    ],
    chinese: ['이호동', '연동', '아라동', '예래동'],
    korean: ['용담2동', '중문동', '성산읍', '안덕면', '우도면'],
    businese: ['삼도1동', '이도2동', '일도2동', '외도동', '화북동', '동홍동'],
    jejusi: ['일도1동', '용담1동', '이도1동', '삼도2동', '건입동'],
    sgpsi: ['송산동', '천지동', '정방동', '중앙동']
};

</script>